Repository: MateuszZawadzki1/focusup-public-version
Catalog: lib/l10n/app_*.arb
Languages: pl

# loginButtonLabel
source: Sign In
pl: Zaloguj się

# signupButtonLabel
source: Create Account
pl: Utwórz konto

# passwordLabel
source: Password
pl: Hasło

source: Sing Up
pl: Zarejestruj się

# dontHaveAccount
source: Don't have an account?
pl: Nie masz konta?

# alreadyHaveAccount
source: Already have an Account?
pl: Masz już konto?

source: Home
pl: Strona główna

source: Sets
pl: Zestawy

source: Focus
pl: Koncentracja

source: Stats
pl: Statystyki

source: Time To Work
pl: Czas do pracy

# chooseOneOfCons
source: Choose one of the concetration methods and see how much easier it is to work
pl: Wybierz jedną z metod koncentracji i zobacz, jak wiele łatwiej Ci się pracuje

# methodBoxBreathing
source: Method of box breathing
pl: Metoda oddychania pudełkowego

# methodOrange
source: Method of oragne
pl: Metoda pomarańczowa

# method478
source: Method of 4-7-8
pl: Metoda 4-7-8

source: Your favorite set
pl: Twój ulubiony zestaw

source: Played
pl: Odtworzono

# mostPopularSet
source: Your the most popular sets
pl: Twoje najpopularniejsze zestawy

source: You might like...
pl: Może Ci się spodobać...

source: Settings
pl: Ustawienia

source: Change Language
pl: Zmień język

source: Logout
pl: Wyloguj się

source: Name your set
pl: Nazwij swój zestaw

source: Make set
pl: Stwórz zestaw

source: Name
pl: Nazwa

source: Legal and policies
pl: Polityka prywatności

# privacyPolicyContent
source: Privacy Policy of the Ambient Focus app This privacy policy describes how personal data is processed in the "Ambient Focus" app. The app was created as an engineering thesis project and is not publicly available in app stores. 1. Data controller The data controller is Mateusz Zawadzki. Contact: matizawadzki@interia.pl. 2. Scope of processed data The app processes the email address, encrypted password, and data about how many times sounds or sets were played. 3. Purpose of processing Data is processed to create and maintain the user account, enable login, display listening statistics, and improve the app as part of the engineering project. 4. User rights The user has the right to access, correct, and delete their data. To exercise these rights, please contact the controller via email. 5. Data security Passwords are stored in hashed/encrypted form. Only the app author has access to the data. 6. Changes to this policy This policy may be updated. The current version is always available in the "Privacy Policy" section of the app.
pl: Polityka prywatności aplikacji Ambient Focus Niniejsza polityka prywatności opisuje zasady przetwarzania danych osobowych w aplikacji „Ambient Focus”. Aplikacja powstała jako projekt inżynierski i nie jest publicznie dostępna w sklepach z aplikacjami. 1. Administrator danych Administratorem danych osobowych jest Mateusz Zawadzki. Kontakt: matizawadzki@interia.pl. 2. Zakres przetwarzanych danych Aplikacja przetwarza adres e-mail, zaszyfrowane hasło oraz dane o liczbie odsłuchań dźwięków. 3. Cel przetwarzania danych Dane są przetwarzane w celu założenia konta, logowania, prezentacji statystyk odsłuchań oraz rozwoju Aplikacji w ramach projektu inżynierskiego. 4. Prawa użytkownika Użytkownik ma prawo dostępu, poprawienia i usunięcia swoich danych. W tym celu należy skontaktować się na podany adres e-mail. 5. Bezpieczeństwo danych Hasła są przechowywane w postaci zhashowanej/szyfrowanej. Dostęp do danych ma wyłącznie autor Aplikacji. 6. Zmiany polityki Polityka może być aktualizowana. Aktualna wersja jest dostępna w zakładce „Polityka prywatności” w Aplikacji.
